## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                      NAME                                      |
|----------|--------------------------------------------------------------------------------|
| update   | `aws_security_group.saas_procurement_rds`                                      |
|          | `module.rds_cluster.aws_rds_cluster.cluster`                                   |
|          | `module.rds_cluster.aws_security_group.rds_proxy`                              |
| recreate | `module.rds_cluster.aws_secretsmanager_secret_version.connection_string`       |
|          | `module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.saas_procurement_rds will be updated in-place
  ~ resource "aws_security_group" "saas_procurement_rds" {
        id                     = "sg-0c4ea26bfaad75c7b"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d1ca7e7e561a219f",
                ]
              - self             = false
              - to_port          = 5432
            },
        ]
        name                   = "saas_procurement_rds"
        tags                   = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.rds_cluster.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
      ~ allow_major_version_upgrade         = true -> false
        id                                  = "saas-procurement-database-cluster"
      ~ master_password                     = (sensitive value)
        tags                                = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database-cluster"
            "Terraform"  = "true"
        }
        # (43 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_cluster.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-XBgmJc" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-XBgmJc|344FF3CC-EB5E-41FF-8159-88E9536018EB" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "344FF3CC-EB5E-41FF-8159-88E9536018EB" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds_cluster.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-proxy-connection-string-fWs71m" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:394954348146:secret:saas-procurement-database-ka0tzp-proxy-connection-string-fWs71m|E022AA4C-24A9-46CA-9345-CF90E068DD6B" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "E022AA4C-24A9-46CA-9345-CF90E068DD6B" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds_cluster.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
        id                     = "sg-051638cd60aef88c3"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 5432
            },
        ]
        name                   = "saas-procurement-database_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "saas-procurement"
            "Name"       = "saas-procurement-database_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
FAIL - plan.json - main - Postgresql main password must not contain / @ or ": ["module.rds_cluster.aws_rds_cluster.cluster"]

18 tests, 17 passed, 0 warnings, 1 failure, 0 exceptions

```

</details>
